tap "dapr/tap"
tap "heroku/brew"
tap "specstoryai/tap"
brew "git"
brew "asdf"
brew "autoconf"
brew "automake"
brew "cmake"
brew "coreutils"
brew "openssl@3"
brew "eza"
brew "gnupg"
brew "htop"
brew "langgraph-cli"
brew "libpq"
brew "libtool"
brew "libyaml"
brew "make"
brew "mise"
brew "neovim"
brew "pkgconf"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "starship"
brew "the_silver_searcher"
brew "vim"
brew "wget"
brew "zlib"
brew "zsh"
brew "dapr/tap/dapr-cli"
brew "heroku/brew/heroku"
brew "specstoryai/tap/specstory"
vscode "1yib.rust-bundle"
vscode "4ops.terraform"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-extension-pack"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "serayuzgur.crates"
vscode "slevesque.vscode-multiclip"
vscode "tal7aouy.theme"
vscode "ue.alphabetical-sorter"
vscode "wholroyd.jinja"
